<a href="https://colab.research.google.com/github/20255A0507/Titanic_Survivors-/blob/main/Titanic_Survivors.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

importing **pandas** and **numpy**

In [ ]:
import pandas as pd
import numpy as np

Reading data using pandas

> we use pandas read_csv function to read the csv file in python and pandas DataFrame method to convert file into the data frame.

In [ ]:
df=pd.DataFrame(pd.read_csv('train.csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape

(891, 12)

Description of attributes of dataset


> passengers:Passenger Class(1=1st,2=2nd,3=3rd)
 survival:Survival(0=no,1=Yes)
 name=Name
  sex=Sex
  age=Age
  sibsp:Number of Siblings/Spouses Abroad
  parch:Number of parents/Children Abroad
  ticket:Ticket Number
  fare:Passenger Fare
  abin=Cabin
  embraked:port of Embarked(C=Cherbourg;Q=Queenstown;S=Southampthon)

In [ ]:
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

HANDLING NULL VALUES

> The dataset may contains many rows and columns for which some values are missing;we cant leave those missing values as it is.In such cases we have two option:


1.   Either drop the entire row and column
2.   Fill the missing values with some appropriate value lets say mean of all the values for that column may do the job

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
drop_col=df.isnull().sum()[df.isnull().sum()>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis=1, inplace = True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

seperating out the columns which have more than 35% of the values missing in the dataset.

In [ ]:
df.fillna(df.mean(), inplace= True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Because Embarked conatins string values,we see the details of the column seperately from others as strings doesnot have eman and all.

In [ ]:
df['Embarked'].fillna('s',inplace=True)
df.isnull().sum()     #now all the null values have been filled

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]


 sibsp:Number of Siblings/Spouses Abroad    
 parch:Number of parents/Children Abroad

> so we can make a new column family_size by combining these two columns.

In [ ]:
df['FamilySize']=df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'],axis=1,inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

FamilySize is the ship doesnot have much correlance with survival rate.
Lets check,if we weather the person was alone or not can affet the survival rate.

In [ ]:
df['Alone']=[0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

So we can see if the person was not alone,the chance the ticket price is higher is high.

In [ ]:
df['Sex']=[0 if df['Sex'][i]=='male' else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked  FamilySize  Alone
0            1         0       3  ...        S           1      0
1            2         1       1  ...        C           1      0
2            3         1       3  ...        S           0      1
3            4         1       1  ...        S           1      0
4            5         0       3  ...        S           0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

If the person is alone he/she has less chance of surviving.

> The reason might be the person who is travaling with his family might be belonging to rich class and might be priorized over other.

In [ ]:
df['Sex']=[0 if df['Sex'][i]=='female' else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked  FamilySize  Alone
0            1         0       3  ...        S           1      0
1            2         1       1  ...        C           1      0
2            3         1       3  ...        S           0      1
3            4         1       1  ...        S           1      0
4            5         0       3  ...        S           0      1

[5 rows x 11 columns]

It shows,female passengers have more chance of surviving than male ones.
It shows women were prioritized over men.

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
s    1.000000
Name: Survived, dtype: float64

# **Conclusion:**


*   Female passengers were prioritized over men.
*   People with high class or rich people have higher survivalrate than others.The hierarchy ,ight have been followed while saving the passengers.
*   Passengers travelling with their family have higher survival rate.
*  Passengers who borded the ship at cherbourg,survived more in proportion then the others.